tup=(10,20,30,40,50)
for i in reversed(tup):
    if tup.index(i)==0:
        print(i,end=' ')
    else:
        print(i,end=',')

#     ✅ Що можна робити з tuple в Python
# ✔️ 1. Доступ за індексом
# t = (10, 20, 30)
# print(t[1])  # 20

# ✔️ 2. Слайси (зрізи)
# print(t[1:3])  # (20, 30)

# ✔️ 3. Перебір у циклі
# for x in t:
#     print(x)

# ✔️ 4. Об’єднання (конкатенація)
# t2 = t + (40, 50)

# ✔️ 5. Повторення
# t3 = t * 2
# # (10, 20, 30, 10, 20, 30)

# ✔️ 6. Методи count() і index()
# t.index(20)  # 1
# t.count(10)  # 1

# ❌ Що НЕ можна робити

# не можна змінювати елементи

# не можна додавати (append)

# не можна видаляти (remove, pop)

# не можна сортувати на місці (sort)

# Тому tuple — незмінний.