arr=[[1,2,3],[4,5,6],[7,8,9],[10,11,12],[14,15,16]]
arr2=[row[:] for row in arr]
z=arr2[0]
arr2[0]=arr2[len(arr2)-1]
arr2[len(arr2)-1]=z
print(arr)
print(arr2)

# arr2=[row[:] for row in arr] !!!
# [:] — створює новий список, який НЕ повʼязаний з оригіналом.

# Без нього — це буде просто інша змінна, яка вказує на той самий список.
# [row for row in arr] створює новий зовнішній список (arr2),

# але внутрішні списки (row) не копіюються — вони ті самі, що в arr.

# Тобто якщо ти міняєш рядок цілком (arr2[0] = ...) — оригінал arr не змінюється.
# Але якщо б ти міняла елемент рядка (arr2[0][0] = 99), то зміни потрапляли б у arr теж.